<?php
include 'components/connect.php';
$comments = mysqli_query($conn, "SELECT * FROM `comments`");
?>
<!DOCTYPE php>
<html lang="ru">

<head>
    <meta charset="UTF-8">
    <meta name="foramt-detection" content="telephone=no">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="css/style.css">
    <title>О компании</title>
</head>

<body>
    <header class="header gray" id="header">
        <div class="header__container container">
            <a href="index.php" class="header__logo logo">
                <svg width="82" height="50" viewBox="0 0 82 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M0 50H38.5L33.5 41.5H14.5L28.5 18L47.5 50H57L28.5 1L0 50Z" fill="#F5F5F5" />
                    <path d="M81 24.4997H51.5L56 32.4997H72.5C70.1 38.0997 64.1667 41.1664 61.5 41.9997L65.5 48.4997C79.5 44.4997 81.6667 30.833 81 24.4997Z" fill="#F5F5F5" />
                    <path d="M41 6.49969L45.5 12.9997C55.9 3.79969 67.1667 11.1664 71.5 15.9997H80.5C66.1 -6.80031 48.1667 0.166353 41 6.49969Z" fill="#F5F5F5" />
                </svg>
            </a>
            <nav class="header__menu menu">
                <ul class="header__menu-list menu-list">
                    <li class="header__menu-link menu-link">
                        <a href="index.php">
                            О компании
                        </a>
                    </li>
                    <li class="header__menu-link menu-link">
                        <a href="about.php">
                            Обо мне
                        </a>
                    </li>
                    <li class="header__menu-link menu-link">
                        <a href="portfolio.php">
                            Портфолио
                        </a>
                    </li>
                    <li class="header__menu-link menu-link">
                        <a href="#contacts">
                            Контакты
                        </a>
                    </li>
                </ul>
            </nav>
        </div>
    </header>
    <main class="page">
        <section class="hello gray">
            <div class="hello__container container">
                <div class="hello__content">
                    <h1 class="hello__title title">
                        Разработка сайтов в Омске
                    </h1>
                    <div class="hello__post">
                        Мы создаем качественные сайты, которые работают на Ваш бизнес.
                    </div>
                    <div class="hello__btns">
                        <div class="open__order hello__btn btn btn__blue">
                            Узнать сроки и стоимость
                        </div>
                        <a href="portfolio.php" class="hello__btn btn">
                            Портфолио
                        </a>
                    </div>
                </div>
                <a href="#services" class="hello__arrow arrow arrow__down">
                    <svg width="70" height="98" viewBox="0 0 70 98" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M33.72 97.2927C31.68 93.0327 28.44 89.0727 24 85.4127V84.2627C25.92 85.1627 27.6 86.0627 29.04 86.9627C30.48 87.8027 32.68 89.6427 33.64 90.4827V35.0127H35.42V90.4827C36.44 89.6427 38.67 87.8027 40.11 86.9627C41.55 86.0627 43.2 85.1627 45.06 84.2627V85.4127C40.68 89.0727 37.44 93.0327 35.34 97.2927H33.72Z" fill="#636363" />
                        <circle cx="35" cy="35.293" r="34" stroke="#636363" stroke-width="2" />
                    </svg>
                </a>
            </div>
        </section>
        <section class="services" id="services">
            <div class="services__container container">
                <h2 class="services__title title">
                    Услуги
                </h2>
                <div class="services__content">
                    <div class="services__item">
                        <div class="services__icon">
                            <svg width="42" height="43" viewBox="0 0 42 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M41.6328 1.82843C41.6226 1.77434 41.6032 1.72563 41.5871 1.67364C41.5703 1.61656 41.5572 1.55829 41.5336 1.5036C41.5091 1.44144 41.4735 1.38496 41.4409 1.32699C41.4191 1.28545 41.3997 1.24212 41.374 1.20267C41.2455 1.01112 41.0805 0.845861 40.8899 0.718264C40.8486 0.692266 40.8068 0.673738 40.7656 0.651325C40.707 0.618752 40.6508 0.58349 40.5881 0.557787C40.534 0.535075 40.4751 0.522226 40.418 0.505192C40.3663 0.489354 40.3173 0.469631 40.2641 0.45947C40.1506 0.436758 40.0361 0.424805 39.922 0.424805L32.0071 0.425104C31.0428 0.425104 30.262 1.20657 30.262 2.17026C30.262 3.13433 31.0428 3.91541 32.0071 3.91541H35.7082L10.8513 28.7746C10.1694 29.4562 10.1694 30.561 10.8513 31.2427C11.192 31.5842 11.6387 31.7543 12.0855 31.7543C12.532 31.7543 12.9784 31.5842 13.3194 31.2427L38.1763 6.38503V10.087C38.1763 11.0511 38.9571 11.8322 39.9214 11.8322C40.8855 11.8322 41.6666 11.0507 41.6666 10.087L41.6669 2.1714C41.6672 2.05695 41.6549 1.9422 41.6331 1.82924L41.6328 1.82843Z" fill="#F5F5F5" />
                                <path d="M21.9479 30.1082V28.4756C21.9479 27.5115 21.1662 26.7305 20.2022 26.7305C19.2381 26.7305 18.457 27.5119 18.457 28.4756V30.1082C18.457 31.0722 19.2385 31.8533 20.2022 31.8533C21.1663 31.8536 21.9479 31.0722 21.9479 30.1082Z" fill="#F5F5F5" />
                                <path d="M28.9298 30.1083V21.4942C28.9298 20.5301 28.1483 19.749 27.1846 19.749C26.2203 19.749 25.4395 20.5305 25.4395 21.4942V30.1083C25.4395 31.0723 26.2203 31.8534 27.1846 31.8534C28.1487 31.8537 28.9298 31.0722 28.9298 30.1083Z" fill="#F5F5F5" />
                                <path d="M35.9122 30.108V14.5124C35.9122 13.5483 35.1307 12.7666 34.167 12.7666C33.2027 12.7666 32.4219 13.5481 32.4219 14.5124V30.108C32.4219 31.072 33.2027 31.8531 34.167 31.8531C35.1308 31.8531 35.9122 31.0717 35.9122 30.1077V30.108Z" fill="#F5F5F5" />
                                <path d="M39.9225 34.8769H7.67938V2.17093C7.67938 1.20686 6.89791 0.425781 5.93422 0.425781C4.97015 0.425781 4.18846 1.20724 4.18846 2.17093V34.8769H1.74515C0.781081 34.8769 0 35.6583 0 36.622C0 37.5861 0.781463 38.3672 1.74515 38.3672H4.18869V40.8107C4.18869 41.7748 4.97015 42.5559 5.93445 42.5559C6.89853 42.5559 7.67961 41.7744 7.67961 40.8107V38.3672H39.9219C40.886 38.3672 41.6671 37.5857 41.6671 36.622C41.6674 35.6583 40.8862 34.8769 39.9222 34.8769H39.9225Z" fill="#F5F5F5" />
                            </svg>
                        </div>
                        <h3 class="services__item-title">
                            Продвижение сайтов
                        </h3>
                        <p class="services__item-text">
                            Комплекс мероприятий для повышения посещаемости сайта по целевым запросам и показа в
                            поисковых
                            системах.
                        </p>
                    </div>
                    <div class="services__item">
                        <div class="services__icon">
                            <svg width="40" height="27" viewBox="0 0 40 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M23.1529 0.000978099C22.6845 0.0124685 22.2318 0.173329 21.8614 0.460584C21.4911 0.747839 21.2218 1.14578 21.0939 1.59658L14.5051 23.5596C14.3377 24.1199 14.4001 24.7236 14.6782 25.2375C14.9563 25.7519 15.4277 26.1341 15.988 26.3004C16.5483 26.4666 17.152 26.4034 17.6656 26.1242C18.1791 25.845 18.5606 25.3727 18.7261 24.812L25.3149 2.84897C25.5259 2.17144 25.3964 1.43373 24.9671 0.868479C24.5381 0.303167 23.8621 -0.0200919 23.1528 0.000969122L23.1529 0.000978099ZM11.0213 1.6483L11.0217 1.64792C10.4491 1.68431 9.91324 1.94283 9.52869 2.36874L0.743285 11.7029C0.362197 12.1101 0.150391 12.6467 0.150391 13.2043C0.150391 13.7619 0.362197 14.2989 0.743285 14.7056L9.52869 24.0398C9.914 24.5124 10.4782 24.8035 11.0864 24.8437C11.6946 24.8839 12.2921 24.6694 12.7364 24.2516C13.1803 23.8337 13.4308 23.2504 13.4277 22.641C13.4246 22.0313 13.1684 21.4502 12.7203 21.037L5.34209 13.2126L12.7203 5.37131C13.1335 4.9458 13.3568 4.37131 13.34 3.7788C13.3231 3.1859 13.0673 2.62476 12.6307 2.22383C12.194 1.82244 11.6138 1.61486 11.0217 1.64779L11.0213 1.6483ZM28.7457 1.6483L28.746 1.64792C28.16 1.62954 27.5905 1.84631 27.165 2.25C26.7395 2.65369 26.4932 3.21058 26.4806 3.79693C26.4683 4.38331 26.6908 4.95018 27.0987 5.3715L34.4769 13.2128L27.0987 21.0372C26.6506 21.4505 26.3944 22.0315 26.3913 22.6412C26.3883 23.2506 26.6387 23.8339 27.0827 24.2518C27.5269 24.6696 28.1244 24.8841 28.7326 24.8439C29.3408 24.8037 29.905 24.5126 30.2903 24.04L39.0757 14.7058C39.4568 14.299 39.6686 13.762 39.6686 13.2044C39.6686 12.6468 39.4568 12.1102 39.0757 11.7031L30.2903 2.36893C29.8935 1.93076 29.3367 1.67109 28.7461 1.64811L28.7457 1.6483Z" fill="#F5F5F5" />
                            </svg>
                        </div>
                        <h3 class="services__item-title">
                            Создание сайтов
                        </h3>
                        <p class="services__item-text">
                            Разработка landing pages, корпоративных сайтов и интернет-магазинов - оптимизированных под
                            мобильные устройства.
                        </p>
                    </div>
                    <div class="services__item">
                        <div class="services__icon">
                            <svg width="42" height="43" viewBox="0 0 42 43" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M24.3131 42.4264H17.2893C16.0514 42.4264 14.8639 41.9345 13.9885 41.0592C13.1131 40.1839 12.6213 38.9964 12.6213 37.7584C12.6257 37.5108 12.5632 37.2665 12.4405 37.0514C12.3175 36.8366 12.1389 36.6588 11.9234 36.5368C11.4955 36.2732 10.9554 36.2732 10.5273 36.5368C9.45479 37.1686 8.17302 37.3417 6.97165 37.0167C5.7786 36.6866 4.76121 35.904 4.13608 34.8355L0.624234 28.7495C0.00672162 27.6788 -0.160887 26.4072 0.158269 25.2131C0.47707 24.019 1.25671 23.0002 2.32562 22.3801C2.54509 22.261 2.7284 22.0846 2.85512 21.8692C2.98184 21.6541 3.04793 21.4083 3.04538 21.1586C3.0483 20.9143 2.98513 20.6736 2.86207 20.4622C2.73901 20.2511 2.56116 20.0769 2.34754 19.959C1.27321 19.3382 0.488784 18.3172 0.165608 17.119C-0.157204 15.9213 0.00748728 14.6442 0.624261 13.5677L4.13611 7.48168C4.76128 6.41315 5.77863 5.63059 6.97168 5.30049C8.18081 5.00617 9.45706 5.21906 10.5055 5.88952C10.7929 6.0732 11.1372 6.14697 11.4746 6.09731C11.8124 6.04801 12.1206 5.8782 12.3434 5.61966C12.5662 5.36112 12.6878 5.031 12.6867 4.68956C12.6808 3.44799 13.1702 2.25494 14.0462 1.37488C14.9223 0.494805 16.1131 0 17.3547 0H24.3785C25.6168 0 26.804 0.491523 27.6794 1.36721C28.5547 2.24254 29.0466 3.42967 29.0466 4.66806C29.0422 4.91565 29.1046 5.15958 29.2273 5.37467C29.3504 5.58976 29.529 5.7676 29.7448 5.88957C30.1728 6.15322 30.7128 6.15322 31.1409 5.88957C32.2131 5.25745 33.4948 5.08436 34.6962 5.40973C35.8892 5.73984 36.9066 6.52238 37.5318 7.59091L41.0436 13.6769L41.044 13.6766C41.6611 14.7473 41.8287 16.0192 41.5099 17.2133C41.1908 18.4071 40.4115 19.4259 39.3422 20.0463C39.1227 20.165 38.9394 20.3418 38.8127 20.5569C38.686 20.7723 38.6203 21.0181 38.6225 21.2679C38.6195 21.5122 38.6831 21.7528 38.8058 21.9639C38.9288 22.1753 39.1067 22.3491 39.3207 22.4674C40.3946 23.0882 41.179 24.1092 41.5022 25.307C41.825 26.5051 41.6603 27.7822 41.0439 28.8587L37.5321 34.9447L37.5317 34.9444C36.9065 36.0129 35.8892 36.7955 34.6961 37.1259C33.5021 37.4524 32.2265 37.2789 31.1623 36.6461C30.8749 36.4624 30.531 36.3883 30.1932 36.4379C29.8554 36.4876 29.5472 36.6571 29.3244 36.9156C29.102 37.1741 28.9801 37.5046 28.9812 37.8457C28.9582 39.0687 28.4564 40.2336 27.5837 41.0903C26.7105 41.947 25.5362 42.4268 24.3132 42.4264L24.3131 42.4264ZM11.2253 33.0686C12.0451 33.0719 12.8499 33.2899 13.5595 33.7014C14.2709 34.1071 14.8621 34.6943 15.2721 35.4035C15.6822 36.1123 15.8966 36.9175 15.8933 37.7366C15.8933 38.1091 16.0397 38.4662 16.3008 38.7318C16.5619 38.9969 16.9172 39.1488 17.2893 39.1546H24.3131C24.6834 39.1546 25.0383 39.0075 25.3002 38.7456C25.5621 38.4838 25.7092 38.1288 25.7092 37.7585C25.7045 36.9362 25.9181 36.1273 26.3278 35.4145C26.7379 34.7017 27.3299 34.1105 28.0431 33.7015C28.75 33.283 29.556 33.0621 30.3773 33.0621C31.1986 33.0621 32.0045 33.283 32.7111 33.7015C33.0318 33.8914 33.4152 33.9451 33.7756 33.8508C34.1361 33.7566 34.4443 33.5222 34.6309 33.1997L38.2519 27.1137C38.4407 26.7964 38.494 26.4166 38.3994 26.0595C38.3052 25.7027 38.0711 25.3985 37.7502 25.2159C36.7975 24.6682 36.0686 23.8012 35.692 22.7685C35.3154 21.7358 35.3155 20.6034 35.692 19.5707C36.0685 18.5383 36.7974 17.6714 37.7502 17.1232C38.0726 16.9366 38.307 16.6288 38.4013 16.2684C38.4955 15.9076 38.4418 15.5245 38.2519 15.2039L34.6309 9.11783C34.4439 8.79685 34.1386 8.56168 33.78 8.46344C33.4247 8.36996 33.0467 8.4251 32.7331 8.61608C31.2866 9.44612 29.5086 9.44576 28.0629 8.61499C26.6167 7.78422 25.7206 6.24833 25.7093 4.58094C25.7093 4.20846 25.5629 3.85132 25.3018 3.5858C25.0407 3.32068 24.6853 3.16877 24.3133 3.16293H17.2895C16.9192 3.16293 16.5642 3.31009 16.3024 3.57192C16.0405 3.83376 15.8934 4.18871 15.8934 4.55903C15.8981 5.3814 15.6845 6.19024 15.2748 6.90306C14.8647 7.61588 14.2727 8.20708 13.5595 8.61607C12.8525 9.03457 12.0466 9.25549 11.2253 9.25549C10.404 9.25549 9.5981 9.03456 8.89145 8.61607C8.57083 8.42619 8.1874 8.3725 7.82694 8.46671C7.46651 8.56093 7.15831 8.79537 6.97171 9.11781L3.45987 15.2038C3.27107 15.5212 3.21776 15.901 3.31197 16.2581C3.40655 16.6148 3.64063 16.919 3.96162 17.1016C4.91432 17.6494 5.64322 18.5163 6.01977 19.5491C6.39626 20.5818 6.39626 21.7142 6.01977 22.7469C5.64328 23.7792 4.91441 24.6461 3.96162 25.1943C3.63551 25.3773 3.39632 25.6836 3.29773 26.0444C3.19949 26.4052 3.24989 26.7905 3.43795 27.1137L6.9498 33.1997C7.13676 33.5207 7.44241 33.7559 7.80065 33.8541C8.15597 33.9476 8.53393 33.8925 8.84759 33.7015C9.57209 33.2885 10.3912 33.0705 11.2253 33.0687V33.0686Z" fill="#F5F5F5" />
                                <path d="M20.801 29.3383C18.6315 29.3383 16.5511 28.4765 15.017 26.9424C13.4829 25.4083 12.6211 23.3279 12.6211 21.1584C12.6211 18.9889 13.4829 16.9085 15.017 15.3744C16.5511 13.8404 18.6315 12.9785 20.801 12.9785C22.9705 12.9785 25.0509 13.8403 26.585 15.3744C28.1191 16.9085 28.9809 18.9889 28.9809 21.1584C28.9809 23.3279 28.1191 25.4083 26.585 26.9424C25.0509 28.4765 22.9705 29.3383 20.801 29.3383ZM20.801 16.2505C19.4991 16.2505 18.251 16.7676 17.3304 17.6878C16.4101 18.6084 15.8931 19.8566 15.8931 21.1584C15.8931 22.4603 16.4101 23.7084 17.3304 24.629C18.251 25.5493 19.4991 26.0664 20.801 26.0664C22.1029 26.0664 23.351 25.5493 24.2716 24.629C25.1919 23.7084 25.7089 22.4603 25.7089 21.1584C25.7089 19.8566 25.1919 18.6084 24.2716 17.6878C23.351 16.7676 22.1029 16.2505 20.801 16.2505Z" fill="#F5F5F5" />
                            </svg>
                        </div>
                        <h3 class="services__item-title">
                            Сопровождение сайтов
                        </h3>
                        <p class="services__item-text">
                            Поддержание и контроль работоспособности сайта, устранение ошибок, бекапы, анализ индексации
                            и посещаемости, консультация.
                        </p>
                    </div>
                    <div class="services__item">
                        <div class="services__icon">
                            <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M25.6223 17.1283L23.6434 19.1071L21.6646 17.1283C19.3627 14.8264 15.6072 14.8264 13.265 17.1283C10.9228 19.4303 10.9631 23.1857 13.265 25.5279L15.3245 27.5873L23.6029 35.7446L31.8814 27.5873L33.9408 25.5279C36.2428 23.2259 36.2428 19.4705 33.9408 17.1283C31.6394 14.7861 27.9645 14.8264 25.622 17.1283H25.6223Z" fill="#F5F5F5" />
                                <path d="M10.3178 3.76229L8.86407 5.21606L7.41029 3.76229C5.71422 2.06622 2.96805 2.06622 1.27205 3.76229C-0.424018 5.45836 -0.424018 8.20453 1.27205 9.90053L2.76614 11.3946L8.82354 17.3309L14.8809 11.3946L16.375 9.90053C18.0711 8.20445 18.0711 5.45829 16.375 3.76229C14.7196 2.06622 11.9734 2.06622 10.3179 3.76229H10.3178Z" fill="#F5F5F5" />
                                <path d="M25.0582 1.01596L24.2101 1.86414L23.3622 1.01596C22.3526 0.0063974 20.7374 0.0063974 19.7279 1.01596C18.7183 2.02553 18.7183 3.64069 19.7279 4.65026L20.6163 5.53868L24.2104 9.0519L27.8044 5.53868L28.6928 4.65026C29.7024 3.64069 29.7024 2.02553 28.6928 1.01596C27.683 0.0063974 26.0678 0.0063974 25.0582 1.01596V1.01596Z" fill="#F5F5F5" />
                            </svg>
                        </div>
                        <h3 class="services__item-title">
                            Social Media Marketing
                        </h3>
                        <p class="services__item-text">
                            Комьюнити-менеджмент и продвижение брендов в социальных сетях Вконтакте, Facebook, Twitter,
                            Instagram, Google+.
                        </p>
                    </div>
                    <div class="services__item">
                        <div class="services__icon">
                            <svg width="40" height="40" viewBox="0 0 40 40" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M11.8116 32.8848L32.8886 11.8078L28.1935 7.1127L7.11653 28.1897L11.8116 32.8848ZM18.9787 28.6138L12.5356 35.0568L12.1918 35.2834L1.95386 39.3786C1.1181 39.7132 0.288463 38.8836 0.622736 38.0478L4.71826 27.809L4.94485 27.4655L11.3879 21.0225L0.848978 10.4844C0.449264 10.0843 0.449264 9.43611 0.848978 9.03637L9.04002 0.84532C9.43974 0.445605 10.088 0.445605 10.488 0.84532L21.0261 11.3843L30.9648 1.44559C32.1657 0.244699 34.1108 0.244699 35.3081 1.44559L38.5549 4.69231C39.7564 5.89074 39.7564 7.83583 38.5559 9.03637L28.6172 18.975L39.1553 29.5131C39.5553 29.9128 39.5553 30.5614 39.1553 30.9611L30.9646 39.1518C30.5649 39.5519 29.9163 39.5519 29.5166 39.1518L18.9787 28.6138ZM20.4264 27.1657L30.2413 36.9807L36.9843 30.2376L34.3368 27.5901L33.0129 28.9141C32.0475 29.8791 30.5999 28.4314 31.5649 27.4661L32.8888 26.1421L30.2413 23.4946L26.8698 26.8661C25.9044 27.8315 24.4568 26.3835 25.4218 25.4181L28.7933 22.047L27.1697 20.4231L20.4264 27.1657ZM12.8356 19.5746L19.5783 12.8319L17.9547 11.2081L16.6312 12.532C15.6658 13.4973 14.2178 12.0493 15.1831 11.084L16.5067 9.76038L13.8592 7.11288L10.488 10.4844C9.5227 11.4494 8.07468 10.0017 9.04002 9.03637L12.4115 5.66486L9.76403 3.01736L3.02101 9.76038L12.8356 19.5746ZM9.98957 33.9591L6.04245 30.0118L3.41109 36.5906L9.98957 33.9591ZM29.6414 5.66486L34.3368 10.36L37.1081 7.58871C37.5088 7.18797 37.5088 6.54078 37.1081 6.14104L33.8596 2.89256C33.4609 2.49285 32.8137 2.49285 32.413 2.89325L29.6414 5.66486Z" fill="#F5F5F5" />
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M0.848242 9.03617L9.03929 0.845127C9.439 0.445413 10.0872 0.445413 10.4873 0.845127L21.0254 11.3841L30.964 1.4454C32.1649 0.244507 34.11 0.244507 35.3074 1.4454L38.5541 4.69212C39.7556 5.89055 39.7556 7.83563 38.5552 9.03617L28.6165 18.9748L39.1545 29.5129C39.5546 29.9126 39.5546 30.5612 39.1545 30.9609L30.9638 39.1516C30.5641 39.5517 29.9156 39.5517 29.5158 39.1516L18.978 28.6136L12.5349 35.0566L12.1911 35.2832L1.95312 39.3784C1.11736 39.713 0.287727 38.8834 0.622 38.0476L4.71752 27.8088L4.94412 27.4653L11.3872 21.0223L0.848242 10.4842C0.448527 10.0841 0.448527 9.43591 0.848242 9.03617ZM10.6168 21.0223L0.462895 10.8692C-0.149246 10.2565 -0.149465 9.26356 0.463047 8.651L8.65411 0.459946C9.26665 -0.152599 10.2596 -0.152338 10.8723 0.459764L21.0254 10.6137L30.5789 1.06022C31.9922 -0.353093 34.2826 -0.353905 35.6931 1.06078L38.9388 4.30644C38.9389 4.30657 38.9391 4.3067 38.9392 4.30683C40.3539 5.7183 40.3532 8.00837 38.9403 9.42135L29.3868 18.9748L39.5396 29.1276C39.5396 29.1276 39.5397 29.1277 39.5397 29.1277C40.1526 29.7402 40.1525 30.7338 39.5396 31.3463L31.3492 39.5366C31.3491 39.5367 31.3491 39.5368 31.349 39.5368C30.7365 40.1497 29.7429 40.1496 29.1305 39.5367L18.978 29.3839L12.8809 35.481L12.4447 35.7685L2.15557 39.8841C0.875021 40.3968 -0.395881 39.1257 0.116224 37.8453L4.23232 27.5551L4.51985 27.1192L10.6168 21.0223ZM25.421 25.4179L28.7925 22.0468L27.169 20.4229L20.4256 27.1656L30.2406 36.9805L36.9836 30.2375L34.3361 27.59L33.0122 28.9139C32.0468 29.8789 30.5991 28.4312 31.5641 27.4659L32.8881 26.1419L30.2406 23.4944L26.8691 26.8659C25.9037 27.8313 24.456 26.3833 25.421 25.4179ZM30.2406 24.2648L27.2542 27.2511C26.9084 27.597 26.4872 27.7512 26.0678 27.7265C25.6619 27.7026 25.299 27.5142 25.036 27.2511C24.7729 26.988 24.5845 26.6251 24.5606 26.2192C24.5359 25.7999 24.69 25.3787 25.0358 25.0328L28.0222 22.0467L27.1689 21.1933L21.196 27.1656L30.2406 36.2101L36.2132 30.2375L34.3361 28.3603L33.3973 29.2991C33.0515 29.6448 32.6302 29.799 32.2109 29.7743C31.805 29.7504 31.4421 29.562 31.1791 29.2989C30.916 29.0359 30.7277 28.673 30.7037 28.2671C30.6791 27.8478 30.8331 27.4266 31.1789 27.0808L32.1177 26.1419L30.2406 24.2648ZM16.6304 12.5318C15.6651 13.4971 14.2171 12.0491 15.1824 11.0838L16.506 9.76019L13.8585 7.11269L10.4873 10.4842C9.52196 11.4492 8.07394 10.0015 9.03929 9.03618L12.4108 5.66467L9.7633 3.01716L3.02027 9.76019L12.8349 19.5744L19.5775 12.8317L17.954 11.2079L16.6304 12.5318ZM17.954 11.9783L17.0156 12.9169C16.6698 13.2628 16.2485 13.417 15.8292 13.3923C15.4232 13.3685 15.0603 13.18 14.7972 12.917C14.5341 12.6539 14.3457 12.291 14.3219 11.885C14.2972 11.4657 14.4514 11.0444 14.7972 10.6986L15.7356 9.76019L13.8585 7.88307L10.8724 10.8695C10.5265 11.2152 10.1053 11.3693 9.68603 11.3446C9.28011 11.3207 8.91721 11.1323 8.65413 10.8693C8.39105 10.6062 8.20263 10.2433 8.17874 9.83738C8.15407 9.41804 8.30826 8.99684 8.65411 8.651L11.6404 5.66467L9.7633 3.78753L3.79064 9.76018L12.8348 18.8041L18.8072 12.8317L17.954 11.9783ZM37.1073 6.14085L33.8589 2.89237C33.4602 2.49266 32.8129 2.49266 32.4122 2.89306L29.6406 5.66467L34.3361 10.3598L37.1073 7.58852C37.5081 7.18777 37.5081 6.54059 37.1073 6.14085ZM34.3361 9.58941L36.7221 7.20333C36.9104 7.01506 36.9097 6.71315 36.7226 6.52651L33.4737 3.27755L33.4732 3.27706C33.288 3.09138 32.986 3.08993 32.7974 3.27824M32.7973 3.27839L30.411 5.66465L34.3361 9.58941M32.8879 11.8076L11.8109 32.8846L7.11579 28.1895L28.1928 7.11251L32.8879 11.8076ZM32.1175 11.8076L11.8109 32.1143L7.88616 28.1895L28.1928 7.88288L32.1175 11.8076ZM6.04171 30.0116L3.41036 36.5904L9.98884 33.9589L6.04171 30.0116ZM6.24068 30.9809L4.38814 35.6126L9.01954 33.76L6.24068 30.9809Z" fill="#F5F5F5" />
                            </svg>
                        </div>
                        <h3 class="services__item-title">
                            Разработка дизайна
                        </h3>
                        <p class="services__item-text">
                            Создание фирменного стиля, логотипа, любой визуальной рекламы, ребрендинг, а также дизайн
                            макетов различной полиграфической продукции.
                        </p>
                    </div>
                    <div class="services__item">
                        <div class="services__icon">
                            <svg width="42" height="42" viewBox="0 0 42 42" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M36.7498 15.7499H27.9992C27.0321 15.7499 26.2499 14.9673 26.2499 13.9998V7.00046C26.2499 3.13479 23.1151 0 19.2501 0H17.5008C16.5325 0 15.7503 0.782592 15.7503 1.75049V10.4999C15.7503 13.3985 13.3989 15.7499 10.5003 15.7499H3.50061C1.57583 15.7499 0 17.3254 0 19.2494V34.9993C0 36.923 1.57612 38.4988 3.50061 38.4988L10.4999 38.4992C11.7135 40.5807 14.916 41.9957 17.5004 41.9957V41.999H36.75C39.6478 41.9957 41.9978 39.6476 41.9978 36.7491H42V21.0001C42 18.1012 39.6478 15.7501 36.75 15.7501L36.7498 15.7499ZM3.50061 34.9995V19.2496H10.4999V34.9995H3.50061ZM38.4982 36.7489C38.4982 37.7171 37.716 38.4993 36.7477 38.4993L17.501 38.499V38.4957C15.5674 38.4957 14.0004 36.9265 14.0004 34.9951L14 18.5111C17.0886 17.1576 19.25 14.0847 19.25 10.4996V3.49985C21.1836 3.49985 22.7502 5.065 22.7502 7.00008V13.9994C22.7502 16.898 25.1016 19.2494 27.999 19.2494H36.7504C37.7175 19.2494 38.4997 20.032 38.4997 20.9999V36.7489L38.4982 36.7489Z" fill="#F5F5F5" />
                            </svg>
                        </div>
                        <h3 class="services__item-title">
                            Управление репутацией
                        </h3>
                        <p class="services__item-text">
                            Защита онлайн-бренда от негативных упоминаний и продвижение на сайтах отзывов, удаление
                            негатива. </p>
                    </div>
                </div>
            </div>
        </section>
        <section class="features gray" id="features">
            <div class="features__container container">
                <h2 class="features__title title">
                    Преимущества
                </h2>
                <div class="features__content">
                    <div class="features__item">
                        <picture>
                            <source srcset="img/emoji/trophy.webp" type="image/webp"><img src="img/emoji/trophy.png" alt="trophy">
                        </picture>
                        <h3 class="features__item-title">
                            Гарантия лучшего качества
                        </h3>
                    </div>
                    <div class="features__item">
                        <picture>
                            <source srcset="img/emoji/time.webp" type="image/webp"><img src="img/emoji/time.png" alt="trophy">
                        </picture>
                        <h3 class="features__item-title">
                            Выполение работы в кротчайшие сроки
                        </h3>
                    </div>
                    <div class="features__item">
                        <picture>
                            <source srcset="img/emoji/handshake.webp" type="image/webp"><img src="img/emoji/handshake.png" alt="trophy">
                        </picture>
                        <h3 class="features__item-title">
                            Выполение всех пожеланий клиента
                        </h3>
                    </div>
                    <div class="features__item">
                        <picture>
                            <source srcset="img/emoji/chart.webp" type="image/webp"><img src="img/emoji/chart.png" alt="trophy">
                        </picture>
                        <h3 class="features__item-title">
                            Увеличение конверсии сайта
                        </h3>
                    </div>
                </div>
            </div>
        </section>
        <section class="price">
            <div class="price__container container">
                <h2 class="price__title title">
                    Прайс лист
                </h2>
                <div class="price__content">
                    <div class="price__item swiper-slide">
                        <div class="price__subtitle">
                            <h3>Landing</h3>
                            <div class="price__subtitle-description">
                                В стоимость входит
                            </div>
                        </div>
                        <div class="price__body">
                            <div class="price__now">
                                <span class="price__now-number">от 44 990</span> ₽​
                            </div>
                            <img class="price__img" src="img/price/landing.svg" alt="landing">
                            <ul class="price__list">
                                <li class="price__list-item">Конверсия сайта до 37%</li>
                                <li class="price__list-item">Прототип (Техническое
                                    Задание)</li>
                                <li class="price__list-item">Уникальный дизайн</li>
                                <li class="price__list-item">Адаптивная версия</li>
                                <li class="price__list-item">Установка аналитики </li>
                                <li class="price__list-item">Базовая SEO-оптимизация​</li>
                                <li class="price__list-item">Домен и хостинг в подарок
                                    стоимостью 2000 руб.​</li>
                                <li class="price__list-item">А/Б тестирование. Интеграция
                                    с CRM</li>
                                <li class="price__list-item">Поддержка и внесение правок 2 месяца</li>
                            </ul>
                            <div class="price__btn">
                                Заказать
                            </div>
                        </div>
                    </div>
                    <div class="price__item swiper-slide">
                        <div class="price__subtitle">
                            <h3>Интернет-магазин</h3>
                            <div class="price__subtitle-description">
                                В стоимость входит
                            </div>
                        </div>
                        <div class="price__body">
                            <div class="price__now">
                                <span class="price__now-number">от 104 990</span> ₽​
                            </div>
                            <img class="price__img" src="img/price/store.svg" alt="store">
                            <ul class="price__list">
                                <li class="price__list-item">Конверсия сайта до 37%</li>
                                <li class="price__list-item">Прототип (Техническое
                                    Задание)</li>
                                <li class="price__list-item">Уникальный дизайн</li>
                                <li class="price__list-item">Адаптивная версия</li>
                                <li class="price__list-item">Установка аналитики </li>
                                <li class="price__list-item">Базовая SEO-оптимизация​</li>
                                <li class="price__list-item">Домен и хостинг в подарок
                                    стоимостью 2000 руб.​</li>
                                <li class="price__list-item">А/Б тестирование. Интеграция
                                    с CRM</li>
                                <li class="price__list-item">Поддержка и внесение правок 2 месяца</li>
                                <li class="price__list-item">Подключение платежных
                                    модулей​</li>
                                <li class="price__list-item">Наполнение товарами​</li>
                                <li class="price__list-item">Разработка индивидуальных
                                    модулей автоматизации​</li>
                                <li class="price__list-item">Поддержка и внесение правок 2 месяца</li>
                            </ul>
                            <div class="price__btn">
                                Заказать
                            </div>
                        </div>
                    </div>
                    <div class="price__item swiper-slide">
                        <div class="price__subtitle">
                            <h3>Многостраничный <br> сайт</h3>
                            <div class="price__subtitle-description">
                                В стоимость входит </div>
                        </div>
                        <div class="price__body">
                            <div class="price__now">
                                <span class="price__now-number">от 69 990</span> ₽​
                            </div>
                            <img class="price__img" src="img/price/corporate.svg" alt="corporate">
                            <ul class="price__list">
                                <li class="price__list-item">Конверсия сайта до 37%</li>
                                <li class="price__list-item">Прототип (Техническое
                                    Задание)</li>
                                <li class="price__list-item">Уникальный дизайн</li>
                                <li class="price__list-item">Адаптивная версия</li>
                                <li class="price__list-item">Установка аналитики </li>
                                <li class="price__list-item">Базовая SEO-оптимизация​</li>
                                <li class="price__list-item">Домен и хостинг в подарок
                                    стоимостью 2000 руб.​</li>
                                <li class="price__list-item">А/Б тестирование. Интеграция
                                    с CRM</li>
                                <li class="price__list-item">Поддержка и внесение правок 2 месяца</li>
                            </ul>
                            <div class="price__btn">
                                Заказать
                            </div>
                        </div>
                    </div>
                    <div class="price__item swiper-slide">
                        <div class="price__subtitle">
                            <h3>Улучшение существующего сайта</h3>
                            <div class="price__subtitle-description">
                                В стоимость входит
                            </div>
                        </div>
                        <div class="price__body">
                            <div class="price__now">
                                <span class="price__now-number">от 24 990</span> ₽​
                            </div>
                            <img class="price__img" src="img/price/card.svg" alt="card">
                            <ul class="price__list">
                                <li class="price__list-item">Конверсия сайта до 37%</li>
                                <li class="price__list-item">Прототип (Техническое
                                    Задание)</li>
                                <li class="price__list-item">Проверка дизайна</li>
                                <li class="price__list-item">Адаптивная версия</li>
                                <li class="price__list-item">Установка аналитики </li>
                                <li class="price__list-item">Базовая SEO-оптимизация​</li>

                                <li class="price__list-item">А/Б тестирование​</li>
                                <li class="price__list-item">Интеграция
                                    с CRM</li>
                            </ul>
                            <div class="price__btn">
                                Заказать
                            </div>
                        </div>
                    </div>
                </div>
            </div>
        </section>
        <section class="how gray">
            <div class="how__container container">
                <h2 class="how__title title">
                    КАК МЫ ДЕЛАЕМ РЕЗУЛЬТАТ
                </h2>
                <ol class="how__content">
                    <li class="how__item">
                        <h3 class="how__item-title">
                            Анализ вашей кампании
                        </h3>
                        <p class="how__item-text">
                            Анализируем вашу компанию, выявляем преимущества, слабые и сильные места. Составляем портрет
                            ЦА.
                        </p>
                    </li>
                    <li class="how__item">
                        <h3 class="how__item-title">
                            Анализируем конкурентов
                        </h3>
                        <p class="how__item-text">
                            Анализируем нишу и сайты конкурентов. Смотрим что работает, работало и не сработало,
                            докручиваем новые гипотезы.
                        </p>
                    </li>
                    <li class="how__item">
                        <h3 class="how__item-title">
                            Составляем прототип
                        </h3>
                        <p class="how__item-text">
                            Делаем продающее, смысловое наполнение сайта с закрытием болей и страхов ЦА. </p>
                    </li>
                    <li class="how__item">
                        <h3 class="how__item-title">
                            Делаем дизайн, верстку, подключаем аналитику, виджеты и интеграции с CRM
                        </h3>
                        <p class="how__item-text">
                            Разрабатываем уникальный дизайн. Делаем адаптивную верстку под все устройства. Настраиваем
                            аналитику, подключаем виджеты и интеграцию с CRM. </p>
                    </li>
                    <li class="how__item">
                        <h3 class="how__item-title">
                            Анализируем результат, вносим правки, улучшаем показатели </h3>
                        <p class="how__item-text">
                            Смотрим что принесло результат, а что нет. Делаем выводы, прописываем гипотезы, планы,
                            делаем правки, запускаем, проводим А/Б тестирование. </p>
                    </li>
                </ol>
            </div>
        </section>
        <section class="comments">
            <div class="comments__container container">
                <h2 class="comments__title title">
                    Отзывы
                </h2>
                <div class="comments__content">
                    <?php foreach ($comments as $comment) { ?>
                        <div class="comments__item">
                            <div class="comments__item-text">
                                <?= $comment['text'] ?>
                            </div>
                            <div class="comments__author">
                                <?= $comment['name'] ?>
                            </div>
                            <div class="comments__where"><?= $comment['link'] ?> </div>
                        </div>
                    <?php } ?>
                </div>
            </div>
        </section>
    </main>
    <section class="contacts gray" id="contacts">
        <div class="contacts__container container">
            <h2 class="contacts__title title">
                Контакты
            </h2>
            <div class="contacts__content">
                <div class="contacts__text">
                    <ul class="contacts__list">
                        <li>
                            <a href="https://yandex.ru/maps/66/omsk/house/ulitsa_pushkina_67k1/Y0oYdQ9nSkMDQFtufXV2dX9jbA==/?ll=73.387364%2C54.974308&source=wizgeo&utm_medium=maps-desktop&utm_source=serp&z=17" class=" contacts__item" target="_blank">
                                <svg class="contacts__mark" width="35" height="36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <g clip-path="url(#clip0_4519_1243)">
                                        <path d="M17.5.5C10.855.5 5.469 5.886 5.469 12.531 5.469 19.176 17.5 35.5 17.5 35.5s12.031-16.324 12.031-22.969S24.145.5 17.5.5zM7.656 12.531c0-5.428 4.416-9.844 9.844-9.844 5.428 0 9.844 4.416 9.844 9.844 0 3.781-5.471 12.91-9.844 19.206-4.373-6.296-9.844-15.425-9.844-19.206zM17.5 7.062A5.468 5.468 0 1017.5 18a5.468 5.468 0 100-10.938zm0 8.75a3.285 3.285 0 01-3.281-3.28A3.285 3.285 0 0117.5 9.25a3.285 3.285 0 013.281 3.281 3.285 3.285 0 01-3.281 3.281z" fill="#f5f5f5" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_4519_1243">
                                            <path fill="#fff" transform="translate(0 .5)" d="M0 0h35v35H0z" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                г. Омск, Пушкина 67/1, офис 618
                            </a>
                        </li>
                        <li>
                            <a href="mailto: i@gubert.ru" class="contacts__item">
                                <svg class="contacts__mark" width="35" height="36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <g clip-path="url(#clip0_4519_1247)" fill="#f5f5f5">
                                        <path d="M30.369.5H4.631C2.077.5 0 2.536 0 5.04v18.92c0 2.504 2.077 4.54 4.631 4.54h25.738c2.553 0 4.631-2.036 4.631-4.54V5.04C35 2.535 32.922.5 30.369.5zm1.803 23.46c0 .975-.809 1.768-1.803 1.768H4.631c-.994 0-1.803-.793-1.803-1.767V5.039c0-.974.809-1.767 1.803-1.767h25.738c.994 0 1.803.793 1.803 1.767v18.922z" />
                                        <path d="M34.744 7.538a1.414 1.414 0 00-1.969-.348L17.5 17.883 2.225 7.19A1.414 1.414 0 10.603 9.507l16.086 11.26a1.412 1.412 0 001.622 0l16.086-11.26c.64-.448.795-1.33.347-1.97z" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_4519_1247">
                                            <path fill="#fff" transform="translate(0 .5)" d="M0 0h35v35H0z" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                i@gubert.ru
                            </a>
                        </li>
                        <li>
                            <a href="tel: +79139887007" class="contacts__item">
                                <svg class="contacts__mark" width="35" height="36" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <g clip-path="url(#clip0_4519_1238)" fill="#f5f5f5">
                                        <path d="M25.65 35.085a17.294 17.294 0 01-4.04-.51c-4.564-1.1-9.264-3.894-13.232-7.866C4.41 22.738 1.613 18.037.512 13.477c-1.16-4.797-.333-8.9 2.326-11.56l.759-.759a3.674 3.674 0 015.19 0L13.15 5.52a3.672 3.672 0 010 5.19l-2.576 2.576c1.235 2.168 2.915 4.337 4.901 6.323 1.986 1.986 4.157 3.667 6.324 4.902l2.576-2.577a3.67 3.67 0 015.19 0l4.362 4.362a3.67 3.67 0 010 5.19l-.76.759c-1.875 1.877-4.469 2.84-7.516 2.84zM6.192 2.695a1.045 1.045 0 00-.748.31l-.76.759c-1.99 1.991-2.572 5.223-1.637 9.097.99 4.102 3.538 8.366 7.174 12.001 3.636 3.636 7.899 6.181 12.002 7.174 3.875.935 7.105.354 9.096-1.637l.76-.76a1.059 1.059 0 000-1.496l-4.361-4.361a1.059 1.059 0 00-1.497 0l-3.265 3.265a1.306 1.306 0 01-1.524.237c-2.677-1.384-5.376-3.4-7.804-5.828-2.43-2.43-4.44-5.126-5.828-7.803a1.306 1.306 0 01.236-1.524l3.266-3.265a1.058 1.058 0 000-1.497L6.941 3.005a1.05 1.05 0 00-.749-.31z" />
                                        <path d="M27.045 19.386a1.306 1.306 0 01-1.306-1.306A8.651 8.651 0 0017.1 9.44a1.306 1.306 0 010-2.612c6.204 0 11.252 5.05 11.252 11.253a1.306 1.306 0 01-1.306 1.306z" />
                                        <path d="M32.564 19.387a1.306 1.306 0 01-1.305-1.306c0-7.808-6.356-14.16-14.16-14.16a1.306 1.306 0 010-2.612c9.248 0 16.771 7.524 16.771 16.772a1.306 1.306 0 01-1.306 1.306z" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_4519_1238">
                                            <path fill="#fff" transform="translate(0 .5)" d="M0 0h35v35H0z" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                +7 (913) 988 70 07
                            </a>
                        </li>
                        <li class="contacts__item-social">
                            <a class="social" href="#">
                                <svg width="35" height="20" viewBox="0 0 35 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M34.8145 18.0499C34.7721 17.9586 34.7326 17.8828 34.6959 17.8221C34.0886 16.7284 32.9282 15.386 31.2153 13.7945L31.1791 13.7581L31.1609 13.7402L31.1426 13.7219H31.1242C30.3468 12.9808 29.8545 12.4825 29.6484 12.2274C29.2712 11.7414 29.1866 11.2495 29.3928 10.751C29.5385 10.3745 30.0856 9.57918 31.0329 8.3641C31.5312 7.72015 31.9258 7.20405 32.2173 6.81521C34.3192 4.02087 35.2304 2.23525 34.9509 1.45764L34.8423 1.27593C34.7693 1.16653 34.581 1.06645 34.2777 0.975175C33.9736 0.884094 33.585 0.869032 33.111 0.929731L27.8629 0.965984C27.7779 0.935858 27.6565 0.938666 27.4984 0.975175C27.3404 1.01168 27.2614 1.03 27.2614 1.03L27.17 1.07564L27.0975 1.13047C27.0368 1.16672 26.9699 1.23048 26.897 1.32163C26.8244 1.41245 26.7637 1.51904 26.7152 1.64051C26.1438 3.11051 25.4942 4.47723 24.7651 5.74062C24.3156 6.49397 23.9027 7.14686 23.5257 7.69966C23.1492 8.25228 22.8333 8.65943 22.5784 8.92042C22.3231 9.18166 22.0927 9.39095 21.8857 9.54905C21.6791 9.70721 21.5214 9.77404 21.4122 9.74959C21.3027 9.72515 21.1997 9.70089 21.1021 9.67664C20.9321 9.56724 20.7954 9.41846 20.6923 9.23017C20.5888 9.04188 20.5191 8.80489 20.4826 8.51939C20.4464 8.2337 20.4249 7.98797 20.4188 7.78136C20.4131 7.57501 20.4157 7.28313 20.4281 6.90655C20.4407 6.52978 20.4464 6.27486 20.4464 6.1412C20.4464 5.67948 20.4554 5.17837 20.4734 4.63776C20.4918 4.09714 20.5067 3.6688 20.5191 3.35324C20.5315 3.03736 20.5373 2.70316 20.5373 2.35084C20.5373 1.99851 20.5158 1.72221 20.4734 1.52166C20.4316 1.32137 20.3673 1.12696 20.2826 0.938475C20.1974 0.750185 20.0727 0.604532 19.909 0.501133C19.7451 0.397861 19.5412 0.315907 19.2986 0.255016C18.6546 0.109299 17.8346 0.0304727 16.8382 0.0182179C14.5787 -0.00603635 13.1268 0.139872 12.483 0.455751C12.2278 0.589214 11.997 0.771567 11.7906 1.00224C11.5718 1.26961 11.5413 1.41552 11.6992 1.43952C12.4283 1.54872 12.9444 1.80997 13.2481 2.22299L13.3576 2.44185C13.4427 2.59976 13.5277 2.87933 13.6128 3.28016C13.6978 3.68099 13.7526 4.1244 13.7767 4.61012C13.8374 5.49712 13.8374 6.25641 13.7767 6.88804C13.7159 7.51993 13.6585 8.01184 13.6036 8.36417C13.5488 8.71649 13.4668 9.00199 13.3576 9.2206C13.2481 9.43927 13.1753 9.57292 13.1388 9.62143C13.1023 9.66994 13.0719 9.70051 13.0478 9.71251C12.8899 9.77302 12.7257 9.80385 12.5557 9.80385C12.3855 9.80385 12.1791 9.7187 11.9361 9.54854C11.6933 9.37838 11.4412 9.14464 11.18 8.84695C10.9187 8.5492 10.6241 8.13311 10.296 7.59863C9.96811 7.06414 9.62791 6.43244 9.27558 5.70354L8.98409 5.17492C8.80186 4.83485 8.55294 4.33969 8.23706 3.68986C7.92098 3.03979 7.64161 2.41096 7.39875 1.80352C7.30167 1.5484 7.15583 1.35418 6.96148 1.22053L6.87027 1.1657C6.80963 1.11719 6.71229 1.06568 6.57877 1.01079C6.44505 0.955963 6.30553 0.916646 6.15962 0.892455L1.1665 0.928709C0.656268 0.928709 0.310071 1.0443 0.127782 1.27516L0.0548273 1.38437C0.0183822 1.4452 0 1.54234 0 1.67606C0 1.80971 0.0364452 1.97375 0.109399 2.16797C0.838303 3.88109 1.63097 5.53325 2.4874 7.12471C3.34383 8.71617 4.08805 9.99814 4.71962 10.9695C5.35131 11.9415 5.9952 12.8589 6.65128 13.7212C7.30735 14.5838 7.74163 15.1366 7.95411 15.3795C8.16685 15.6228 8.33395 15.8047 8.45541 15.9261L8.91107 16.3634C9.20263 16.655 9.63078 17.0043 10.1957 17.4112C10.7608 17.8183 11.3863 18.2192 12.0727 18.6143C12.7593 19.0088 13.5579 19.3308 14.4692 19.5798C15.3803 19.829 16.2671 19.929 17.1297 19.8808H19.2254C19.6505 19.8441 19.9725 19.7104 20.1913 19.4798L20.2638 19.3884C20.3126 19.3159 20.3582 19.2033 20.4004 19.0517C20.443 18.8998 20.4642 18.7325 20.4642 18.5506C20.4517 18.0283 20.4915 17.5575 20.5824 17.1385C20.6732 16.7195 20.7767 16.4036 20.8925 16.1909C21.0082 15.9783 21.1388 15.799 21.2842 15.6536C21.4298 15.5079 21.5336 15.4196 21.5945 15.3892C21.655 15.3586 21.7033 15.3379 21.7398 15.3255C22.0313 15.2283 22.3745 15.3224 22.7697 15.6081C23.1646 15.8936 23.535 16.2462 23.8814 16.6651C24.2277 17.0845 24.6437 17.5549 25.1296 18.0772C25.6157 18.5997 26.0408 18.9881 26.4051 19.2436L26.7695 19.4623C27.0128 19.6082 27.3286 19.7418 27.7175 19.8633C28.1056 19.9847 28.4457 20.0151 28.7377 19.9544L33.4026 19.8816C33.864 19.8816 34.223 19.8052 34.4777 19.6536C34.7329 19.5018 34.8845 19.3345 34.9334 19.1525C34.9821 18.9704 34.9847 18.7637 34.9426 18.5326C34.8994 18.3022 34.8568 18.141 34.8145 18.0499Z" fill="#f5f5f5" />
                                </svg>
                            </a>
                            <a class="social" href="#">
                                <svg width="33" height="32" viewBox="0 0 33 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M22.4605 0.00390625H10.5063C5.00564 0.00390625 0.572266 4.4379 0.572266 9.91314V21.8131C0.572266 27.2887 5.00564 31.791 10.5063 31.791H22.4605C27.9611 31.791 32.4961 27.2887 32.4961 21.8131V9.91314C32.4961 4.4379 27.9611 0.00390625 22.4605 0.00390625ZM29.4883 21.8131C29.4883 25.6404 26.3053 28.7832 22.4605 28.7832H10.5063C6.6611 28.7832 3.51172 25.6404 3.51172 21.8131V9.91314C3.51172 6.08604 6.6611 2.94336 10.5063 2.94336H22.4605C26.3053 2.94336 29.4883 6.08604 29.4883 9.91314V21.8131Z" fill="#f5f5f5" />
                                    <path d="M16.4831 7.92969C12.082 7.92969 8.51367 11.4817 8.51367 15.8631C8.51367 20.2439 12.082 23.7959 16.4831 23.7959C20.8843 23.7959 24.4524 20.2439 24.4524 15.8631C24.4524 11.4817 20.8843 7.92969 16.4831 7.92969ZM16.4831 20.8212C13.7375 20.8212 11.5024 18.596 11.5024 15.8631C11.5024 13.1277 13.7375 10.9048 16.4831 10.9048C19.2285 10.9048 21.4638 13.1277 21.4638 15.8631C21.4638 18.596 19.2285 20.8212 16.4831 20.8212Z" fill="#f5f5f5" />
                                    <path d="M25.0504 6.27832C24.4639 6.27832 23.9883 6.75164 23.9883 7.33536C23.9883 7.91915 24.4639 8.39268 25.0504 8.39268C25.6365 8.39268 26.1122 7.91915 26.1122 7.33536C26.1122 6.75164 25.6365 6.27832 25.0504 6.27832Z" fill="#f5f5f5" />
                                </svg>
                            </a>
                        </li>
                    </ul>
                </div>
                <form class="contacts__form form" action="telegram.php" method="post">
                    <h3 class="contacts__form-title form-title">
                        Узнать сроки и стоимость
                    </h3>
                    <div class="input__container">
                        <input type="text" name="name" id="name" class="contacts__form-input input" required>
                        <label for="name" class="contacts__form-label label">Имя</label>
                    </div>
                    <div class="input__container">
                        <input type="tel" name="phonenumber" id="phonenumber" class="contacts__form-input input" required>
                        <label for="phonenumber" class="contacts__form-label label">Телефон</label>
                    </div>
                    <div class="input__container">
                        <input type="text" name="email" id="email" class="contacts__form-input input" required>
                        <label for="email" class="contacts__form-label label">Почта</label>
                    </div>
                    <input class="contacts__btn btn btn__blue" type="submit" value="Отправить">
                </form>
            </div>
        </div>
    </section>
    <footer class="footer gray">
        <div class="footer__container container">
            <a href="index.php" class="footer__logo logo">
                <svg width="82" height="50" viewBox="0 0 82 50" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M0 50H38.5L33.5 41.5H14.5L28.5 18L47.5 50H57L28.5 1L0 50Z" fill="white" />
                    <path d="M81 24.4997H51.5L56 32.4997H72.5C70.1 38.0997 64.1667 41.1664 61.5 41.9997L65.5 48.4997C79.5 44.4997 81.6667 30.833 81 24.4997Z" fill="white" />
                    <path d="M41 6.49969L45.5 12.9997C55.9 3.79969 67.1667 11.1664 71.5 15.9997H80.5C66.1 -6.80031 48.1667 0.166353 41 6.49969Z" fill="white" />
                </svg>
            </a>
            <nav class="footer__menu menu">
                <ul class="footer__menu-list menu-list">
                    <li class="footer__menu-link menu-link">
                        <a href="index.php">
                            О компании
                        </a>
                    </li>
                    <li class="footer__menu-link menu-link">
                        <a href="about.php">
                            Обо мне
                        </a>
                    </li>
                    <li class="footer__menu-link menu-link">
                        <a href="portfolio.php">
                            Портфолио
                        </a>
                    </li>
                    <li class="footer__menu-link menu-link">
                        <a href="#contacts">
                            Контакты
                        </a>
                    </li>
                </ul>
            </nav>
            <a href="#header" class="footer__arrow arrow arrow__up">
                <svg width="70" height="98" viewBox="0 0 70 98" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M33.72 97.2927C31.68 93.0327 28.44 89.0727 24 85.4127V84.2627C25.92 85.1627 27.6 86.0627 29.04 86.9627C30.48 87.8027 32.68 89.6427 33.64 90.4827V35.0127H35.42V90.4827C36.44 89.6427 38.67 87.8027 40.11 86.9627C41.55 86.0627 43.2 85.1627 45.06 84.2627V85.4127C40.68 89.0727 37.44 93.0327 35.34 97.2927H33.72Z" fill="#636363" />
                    <circle cx="35" cy="35.293" r="34" stroke="#636363" stroke-width="2" />
                </svg>
            </a>
        </div>
        <div class="footer__copyright container">© 2022 Быкова Юлия. Все права защищены.</div>
    </footer>
    <div class="order" id="order">
        <div class="close gray"></div>
        <div class="order__container">
            <form class="order__form form">
                <div class="order__close">
                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M0 0.555556L0.555556 0L10 7.88889L19.4444 0L20 0.555556L12.1111 10L20 19.4444L19.4444 20L10 12.1111L0.555556 20L0 19.4444L7.88889 10L0 0.555556Z" fill="#A0A0A0" />
                    </svg>
                </div>
                <h3 class="order__form-title form-title">
                    Узнать сроки и стоимость
                </h3>
                <div class="input__container">
                    <input type="text" name="name" id="name" class="order__form-input input" required>
                    <label for="name" class="order__form-label label">Имя</label>
                </div>
                <div class="input__container">
                    <input type="text" name="phonenumber" id="phonenumber" class="order__form-input input" required>
                    <label for="phonenumber" class="order__form-label label">Телефон</label>
                </div>
                <div class="input__container">
                    <input type="text" name="email" id="email" class="order__form-input input" required>
                    <label for="email" class="order__form-label label">Почта</label>
                </div>
                <input class="order__btn btn btn__blue" type="submit" value="Отправить">
            </form>
        </div>
    </div>
    <script src="https://code.jquery.com/jquery-3.6.0.min.js"></script>
    <script src="js/script.js"></script>
    <script>
        $(".arrow").on("click", function(event) {
            //отменяем стандартную обработку нажатия по ссылке
            event.preventDefault();

            //забираем идентификатор бока с атрибута href
            var id = $(this).attr('href'),

                //узнаем высоту от начала страницы до блока на который ссылается якорь
                top = $(id).offset().top;

            //анимируем переход на расстояние - top за 1500 мс
            $('body,html').animate({
                scrollTop: top
            }, 1000);
        });
    </script>
</body>

</html>